Revit 2026 API

# LinkConversionData Class

---

This class contains the information necessary to re-create a Revit document from an external source.

SystemObject Autodesk.Revit.DBLinkConversionData

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class LinkConversionData : IDisposable
```
```vb
Public Class LinkConversionData
	Implements IDisposable
```
```cpp
public ref class LinkConversionData : IDisposable
```
```fsharp
type LinkConversionData =
    class
        interface IDisposable
    end
```

The LinkConversionData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Path | The path to the source data used to generate the model. |
|  | ServerId | The service responsible for converting the data into a Revit file. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the LinkConversionData |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetOptions | Extra information used during the creation of the Revit document. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace